app/controllers/requests_controller.rb

SELECT `requests`.* FROM `requests` ORDER BY requests.id DESC LIMIT 1
SELECT `requests`.* FROM `requests`
---
  def index
    @last_request_created_at = Request.last.created_at
    @requests = Request.all:order => 'created_at desc'

SELECT COUNT(*) FROM `requests` WHERE (created_at IN ())
---
  def check_for_new_requests
    @requests_count = Request.all.count

SELECT `requests`.* FROM `requests`
---
  def fetch_new_requests
    @requests_count = Request.all.count
    @current_requests_count = params[:count].to_i
    unless @request_count == @current_requests_count
      @new_requests_count = @requests_count - @current_requests_count

      @new_requests = Request.all.last(@new_requests_count).reverse

SELECT `requests`.* FROM `requests` WHERE (`requests`.`id` = 1) LIMIT 1
---
  def show
    @request = Request.find(params[:id])

INSERT INTO `requests` (`fullname`, `email`, `price`, `details`, `created_at`, `updated_at`) VALUES ('', '', NULL, '', '2011-01-14 09:06:16', '2011-01-14 09:06:16')
---
  def create
    @request = Request.new(params[:request])

    respond_to do |format|
      if @request.save

SELECT `requests`.* FROM `requests` WHERE (`requests`.`id` = 1) LIMIT 1
DELETE FROM `requests` WHERE (`requests`.`id` = 1)
---
  def destroy
    @request = Request.find(params[:id])
    @request.destroy